test/k6/results/ramp-capped-2026-04-20.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6/ramp.js
        output: json (test/k6/results/ramp-capped-2026-04-20.json)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 5m0s max duration (incl. graceful stop):
              * ramp: Up to 10 looping VUs for 4m30s over 11 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 733 complete and 0 interrupted iterations
ramp   [   0% ] 01/10 VUs  0m01.0s/4m30.0s

running (0m02.0s), 01/10 VUs, 1548 complete and 0 interrupted iterations
ramp   [   1% ] 01/10 VUs  0m02.0s/4m30.0s

running (0m03.0s), 01/10 VUs, 2317 complete and 0 interrupted iterations
ramp   [   1% ] 01/10 VUs  0m03.0s/4m30.0s

running (0m04.0s), 01/10 VUs, 3133 complete and 0 interrupted iterations
ramp   [   1% ] 01/10 VUs  0m04.0s/4m30.0s

running (0m05.0s), 01/10 VUs, 3950 complete and 0 interrupted iterations
ramp   [   2% ] 01/10 VUs  0m05.0s/4m30.0s

running (0m06.0s), 01/10 VUs, 4747 complete and 0 interrupted iterations
ramp   [   2% ] 01/10 VUs  0m06.0s/4m30.0s

running (0m07.0s), 01/10 VUs, 5561 complete and 0 interrupted iterations
ramp   [   3% ] 01/10 VUs  0m07.0s/4m30.0s

running (0m08.0s), 01/10 VUs, 6314 complete and 0 interrupted iterations
ramp   [   3% ] 01/10 VUs  0m08.0s/4m30.0s

running (0m09.0s), 01/10 VUs, 7117 complete and 0 interrupted iterations
ramp   [   3% ] 01/10 VUs  0m09.0s/4m30.0s

running (0m10.0s), 01/10 VUs, 7919 complete and 0 interrupted iterations
ramp   [   4% ] 01/10 VUs  0m10.0s/4m30.0s

running (0m11.0s), 01/10 VUs, 8711 complete and 0 interrupted iterations
ramp   [   4% ] 01/10 VUs  0m11.0s/4m30.0s

running (0m12.0s), 01/10 VUs, 9530 complete and 0 interrupted iterations
ramp   [   4% ] 01/10 VUs  0m12.0s/4m30.0s

running (0m13.0s), 01/10 VUs, 10352 complete and 0 interrupted iterations
ramp   [   5% ] 01/10 VUs  0m13.0s/4m30.0s

running (0m14.0s), 01/10 VUs, 11164 complete and 0 interrupted iterations
ramp   [   5% ] 01/10 VUs  0m14.0s/4m30.0s

running (0m15.0s), 01/10 VUs, 11959 complete and 0 interrupted iterations
ramp   [   6% ] 01/10 VUs  0m15.0s/4m30.0s

running (0m15.9s), 01/10 VUs, 12769 complete and 0 interrupted iterations
ramp   [   6% ] 01/10 VUs  0m16.0s/4m30.0s

running (0m16.9s), 01/10 VUs, 13611 complete and 0 interrupted iterations
ramp   [   6% ] 01/10 VUs  0m17.0s/4m30.0s

running (0m17.9s), 01/10 VUs, 14407 complete and 0 interrupted iterations
ramp   [   7% ] 01/10 VUs  0m18.0s/4m30.0s

running (0m18.9s), 01/10 VUs, 15248 complete and 0 interrupted iterations
ramp   [   7% ] 01/10 VUs  0m19.0s/4m30.0s

running (0m19.9s), 01/10 VUs, 16066 complete and 0 interrupted iterations
ramp   [   7% ] 01/10 VUs  0m20.0s/4m30.0s

running (0m20.9s), 02/10 VUs, 17706 complete and 0 interrupted iterations
ramp   [   8% ] 02/10 VUs  0m21.0s/4m30.0s

running (0m21.9s), 02/10 VUs, 19419 complete and 0 interrupted iterations
ramp   [   8% ] 02/10 VUs  0m22.0s/4m30.0s

running (0m22.9s), 02/10 VUs, 21110 complete and 0 interrupted iterations
ramp   [   9% ] 02/10 VUs  0m23.0s/4m30.0s

running (0m23.9s), 02/10 VUs, 22794 complete and 0 interrupted iterations
ramp   [   9% ] 02/10 VUs  0m24.0s/4m30.0s

running (0m24.9s), 02/10 VUs, 24396 complete and 0 interrupted iterations
ramp   [   9% ] 02/10 VUs  0m25.0s/4m30.0s

running (0m25.9s), 02/10 VUs, 26046 complete and 0 interrupted iterations
ramp   [  10% ] 02/10 VUs  0m26.0s/4m30.0s

running (0m26.9s), 02/10 VUs, 27738 complete and 0 interrupted iterations
ramp   [  10% ] 02/10 VUs  0m27.0s/4m30.0s

running (0m27.9s), 02/10 VUs, 29325 complete and 0 interrupted iterations
ramp   [  10% ] 02/10 VUs  0m28.0s/4m30.0s

running (0m28.9s), 02/10 VUs, 30972 complete and 0 interrupted iterations
ramp   [  11% ] 02/10 VUs  0m29.0s/4m30.0s

running (0m29.9s), 02/10 VUs, 32648 complete and 0 interrupted iterations
ramp   [  11% ] 02/10 VUs  0m30.0s/4m30.0s

running (0m30.9s), 02/10 VUs, 34323 complete and 0 interrupted iterations
ramp   [  11% ] 02/10 VUs  0m31.0s/4m30.0s

running (0m31.9s), 02/10 VUs, 36010 complete and 0 interrupted iterations
ramp   [  12% ] 02/10 VUs  0m32.0s/4m30.0s

running (0m32.9s), 02/10 VUs, 37688 complete and 0 interrupted iterations
ramp   [  12% ] 02/10 VUs  0m33.0s/4m30.0s

running (0m33.9s), 02/10 VUs, 39378 complete and 0 interrupted iterations
ramp   [  13% ] 02/10 VUs  0m34.0s/4m30.0s

running (0m34.9s), 02/10 VUs, 41044 complete and 0 interrupted iterations
ramp   [  13% ] 02/10 VUs  0m35.0s/4m30.0s

running (0m35.9s), 02/10 VUs, 42739 complete and 0 interrupted iterations
ramp   [  13% ] 02/10 VUs  0m36.0s/4m30.0s

running (0m36.9s), 02/10 VUs, 44344 complete and 0 interrupted iterations
ramp   [  14% ] 02/10 VUs  0m37.0s/4m30.0s

running (0m37.9s), 02/10 VUs, 45950 complete and 0 interrupted iterations
ramp   [  14% ] 02/10 VUs  0m38.0s/4m30.0s

running (0m38.9s), 02/10 VUs, 47635 complete and 0 interrupted iterations
ramp   [  14% ] 02/10 VUs  0m39.0s/4m30.0s

running (0m39.9s), 02/10 VUs, 49250 complete and 0 interrupted iterations
ramp   [  15% ] 02/10 VUs  0m40.0s/4m30.0s

running (0m40.9s), 02/10 VUs, 50899 complete and 0 interrupted iterations
ramp   [  15% ] 02/10 VUs  0m41.0s/4m30.0s

running (0m41.9s), 02/10 VUs, 52585 complete and 0 interrupted iterations
ramp   [  16% ] 02/10 VUs  0m42.0s/4m30.0s

running (0m42.9s), 02/10 VUs, 54262 complete and 0 interrupted iterations
ramp   [  16% ] 02/10 VUs  0m43.0s/4m30.0s

running (0m43.9s), 02/10 VUs, 55923 complete and 0 interrupted iterations
ramp   [  16% ] 02/10 VUs  0m44.0s/4m30.0s

running (0m44.9s), 02/10 VUs, 57608 complete and 0 interrupted iterations
ramp   [  17% ] 02/10 VUs  0m45.0s/4m30.0s

running (0m45.7s), 02/10 VUs, 59220 complete and 0 interrupted iterations
ramp   [  17% ] 02/10 VUs  0m46.0s/4m30.0s

running (0m46.7s), 02/10 VUs, 60944 complete and 0 interrupted iterations
ramp   [  17% ] 02/10 VUs  0m47.0s/4m30.0s

running (0m47.7s), 02/10 VUs, 62584 complete and 0 interrupted iterations
ramp   [  18% ] 02/10 VUs  0m48.0s/4m30.0s

running (0m48.7s), 02/10 VUs, 64305 complete and 0 interrupted iterations
ramp   [  18% ] 02/10 VUs  0m49.0s/4m30.0s

running (0m49.7s), 02/10 VUs, 65986 complete and 0 interrupted iterations
ramp   [  19% ] 02/10 VUs  0m50.0s/4m30.0s

running (0m50.7s), 02/10 VUs, 67691 complete and 0 interrupted iterations
ramp   [  19% ] 02/10 VUs  0m51.0s/4m30.0s

running (0m51.7s), 02/10 VUs, 69389 complete and 0 interrupted iterations
ramp   [  19% ] 02/10 VUs  0m52.0s/4m30.0s

running (0m52.7s), 02/10 VUs, 71099 complete and 0 interrupted iterations
ramp   [  20% ] 02/10 VUs  0m53.0s/4m30.0s

running (0m53.7s), 02/10 VUs, 72796 complete and 0 interrupted iterations
ramp   [  20% ] 02/10 VUs  0m54.0s/4m30.0s

running (0m54.7s), 02/10 VUs, 74508 complete and 0 interrupted iterations
ramp   [  20% ] 02/10 VUs  0m55.0s/4m30.0s

running (0m55.7s), 02/10 VUs, 76185 complete and 0 interrupted iterations
ramp   [  21% ] 02/10 VUs  0m56.0s/4m30.0s

running (0m56.7s), 02/10 VUs, 77892 complete and 0 interrupted iterations
ramp   [  21% ] 02/10 VUs  0m57.0s/4m30.0s

running (0m57.7s), 02/10 VUs, 79491 complete and 0 interrupted iterations
ramp   [  21% ] 02/10 VUs  0m58.0s/4m30.0s

running (0m58.7s), 02/10 VUs, 81172 complete and 0 interrupted iterations
ramp   [  22% ] 02/10 VUs  0m59.0s/4m30.0s

running (0m59.7s), 02/10 VUs, 82835 complete and 0 interrupted iterations
ramp   [  22% ] 02/10 VUs  1m00.0s/4m30.0s

running (1m00.7s), 02/10 VUs, 84463 complete and 0 interrupted iterations
ramp   [  23% ] 02/10 VUs  1m01.0s/4m30.0s

running (1m01.7s), 02/10 VUs, 86156 complete and 0 interrupted iterations
ramp   [  23% ] 02/10 VUs  1m02.0s/4m30.0s

running (1m02.7s), 02/10 VUs, 87824 complete and 0 interrupted iterations
ramp   [  23% ] 02/10 VUs  1m03.0s/4m30.0s

running (1m03.7s), 02/10 VUs, 89503 complete and 0 interrupted iterations
ramp   [  24% ] 02/10 VUs  1m04.0s/4m30.0s

running (1m04.7s), 02/10 VUs, 91165 complete and 0 interrupted iterations
ramp   [  24% ] 02/10 VUs  1m05.0s/4m30.0s

running (1m05.7s), 02/10 VUs, 92853 complete and 0 interrupted iterations
ramp   [  24% ] 02/10 VUs  1m06.0s/4m30.0s

running (1m06.7s), 02/10 VUs, 94510 complete and 0 interrupted iterations
ramp   [  25% ] 02/10 VUs  1m07.0s/4m30.0s

running (1m07.7s), 02/10 VUs, 96116 complete and 0 interrupted iterations
ramp   [  25% ] 02/10 VUs  1m08.0s/4m30.0s

running (1m08.7s), 02/10 VUs, 97799 complete and 0 interrupted iterations
ramp   [  26% ] 02/10 VUs  1m09.0s/4m30.0s

running (1m09.7s), 02/10 VUs, 99468 complete and 0 interrupted iterations
ramp   [  26% ] 02/10 VUs  1m10.0s/4m30.0s

running (1m10.7s), 03/10 VUs, 101425 complete and 0 interrupted iterations
ramp   [  26% ] 03/10 VUs  1m11.0s/4m30.0s

running (1m11.7s), 03/10 VUs, 103415 complete and 0 interrupted iterations
ramp   [  27% ] 03/10 VUs  1m12.0s/4m30.0s

running (1m12.7s), 03/10 VUs, 105300 complete and 0 interrupted iterations
ramp   [  27% ] 03/10 VUs  1m13.0s/4m30.0s

running (1m13.7s), 03/10 VUs, 107256 complete and 0 interrupted iterations
ramp   [  27% ] 03/10 VUs  1m14.0s/4m30.0s

running (1m14.7s), 03/10 VUs, 109114 complete and 0 interrupted iterations
ramp   [  28% ] 03/10 VUs  1m15.0s/4m30.0s

running (1m15.6s), 03/10 VUs, 111115 complete and 0 interrupted iterations
ramp   [  28% ] 03/10 VUs  1m16.0s/4m30.0s

running (1m16.6s), 03/10 VUs, 113151 complete and 0 interrupted iterations
ramp   [  29% ] 03/10 VUs  1m17.0s/4m30.0s

running (1m17.6s), 03/10 VUs, 115093 complete and 0 interrupted iterations
ramp   [  29% ] 03/10 VUs  1m18.0s/4m30.0s

running (1m18.6s), 03/10 VUs, 117164 complete and 0 interrupted iterations
ramp   [  29% ] 03/10 VUs  1m19.0s/4m30.0s

running (1m19.6s), 03/10 VUs, 119178 complete and 0 interrupted iterations
ramp   [  30% ] 03/10 VUs  1m20.0s/4m30.0s

running (1m20.6s), 03/10 VUs, 121231 complete and 0 interrupted iterations
ramp   [  30% ] 03/10 VUs  1m21.0s/4m30.0s

running (1m21.6s), 03/10 VUs, 123244 complete and 0 interrupted iterations
ramp   [  30% ] 03/10 VUs  1m22.0s/4m30.0s

running (1m22.6s), 03/10 VUs, 125281 complete and 0 interrupted iterations
ramp   [  31% ] 03/10 VUs  1m23.0s/4m30.0s

running (1m23.6s), 03/10 VUs, 127199 complete and 0 interrupted iterations
ramp   [  31% ] 03/10 VUs  1m24.0s/4m30.0s

running (1m24.6s), 03/10 VUs, 129130 complete and 0 interrupted iterations
ramp   [  31% ] 03/10 VUs  1m25.0s/4m30.0s

running (1m25.6s), 03/10 VUs, 131170 complete and 0 interrupted iterations
ramp   [  32% ] 03/10 VUs  1m26.0s/4m30.0s

running (1m26.6s), 03/10 VUs, 133194 complete and 0 interrupted iterations
ramp   [  32% ] 03/10 VUs  1m27.0s/4m30.0s

running (1m27.6s), 03/10 VUs, 135122 complete and 0 interrupted iterations
ramp   [  33% ] 03/10 VUs  1m28.0s/4m30.0s

running (1m28.6s), 03/10 VUs, 137135 complete and 0 interrupted iterations
ramp   [  33% ] 03/10 VUs  1m29.0s/4m30.0s

running (1m29.6s), 03/10 VUs, 139140 complete and 0 interrupted iterations
ramp   [  33% ] 03/10 VUs  1m30.0s/4m30.0s

running (1m30.6s), 03/10 VUs, 141134 complete and 0 interrupted iterations
ramp   [  34% ] 03/10 VUs  1m31.0s/4m30.0s

running (1m31.6s), 03/10 VUs, 143170 complete and 0 interrupted iterations
ramp   [  34% ] 03/10 VUs  1m32.0s/4m30.0s

running (1m32.6s), 03/10 VUs, 145186 complete and 0 interrupted iterations
ramp   [  34% ] 03/10 VUs  1m33.0s/4m30.0s

running (1m33.6s), 03/10 VUs, 147200 complete and 0 interrupted iterations
ramp   [  35% ] 03/10 VUs  1m34.0s/4m30.0s

running (1m34.6s), 03/10 VUs, 149200 complete and 0 interrupted iterations
ramp   [  35% ] 03/10 VUs  1m35.0s/4m30.0s

running (1m35.6s), 03/10 VUs, 151228 complete and 0 interrupted iterations
ramp   [  36% ] 03/10 VUs  1m36.0s/4m30.0s

running (1m36.6s), 03/10 VUs, 153225 complete and 0 interrupted iterations
ramp   [  36% ] 03/10 VUs  1m37.0s/4m30.0s

running (1m37.6s), 03/10 VUs, 155144 complete and 0 interrupted iterations
ramp   [  36% ] 03/10 VUs  1m38.0s/4m30.0s

running (1m38.6s), 03/10 VUs, 157167 complete and 0 interrupted iterations
ramp   [  37% ] 03/10 VUs  1m39.0s/4m30.0s

running (1m39.6s), 03/10 VUs, 159164 complete and 0 interrupted iterations
ramp   [  37% ] 03/10 VUs  1m40.0s/4m30.0s

running (1m40.6s), 03/10 VUs, 161179 complete and 0 interrupted iterations
ramp   [  37% ] 03/10 VUs  1m41.0s/4m30.0s

running (1m41.6s), 03/10 VUs, 163120 complete and 0 interrupted iterations
ramp   [  38% ] 03/10 VUs  1m42.0s/4m30.0s

running (1m42.6s), 03/10 VUs, 165162 complete and 0 interrupted iterations
ramp   [  38% ] 03/10 VUs  1m43.0s/4m30.0s

running (1m43.6s), 03/10 VUs, 167169 complete and 0 interrupted iterations
ramp   [  39% ] 03/10 VUs  1m44.0s/4m30.0s

running (1m44.6s), 03/10 VUs, 169200 complete and 0 interrupted iterations
ramp   [  39% ] 03/10 VUs  1m45.0s/4m30.0s

running (1m45.5s), 03/10 VUs, 171194 complete and 0 interrupted iterations
ramp   [  39% ] 03/10 VUs  1m46.0s/4m30.0s

running (1m46.5s), 03/10 VUs, 173255 complete and 0 interrupted iterations
ramp   [  40% ] 03/10 VUs  1m47.0s/4m30.0s

running (1m47.5s), 03/10 VUs, 175221 complete and 0 interrupted iterations
ramp   [  40% ] 03/10 VUs  1m48.0s/4m30.0s

running (1m48.5s), 03/10 VUs, 177290 complete and 0 interrupted iterations
ramp   [  40% ] 03/10 VUs  1m49.0s/4m30.0s

running (1m49.5s), 03/10 VUs, 179316 complete and 0 interrupted iterations
ramp   [  41% ] 03/10 VUs  1m50.0s/4m30.0s

running (1m50.5s), 04/10 VUs, 181525 complete and 0 interrupted iterations
ramp   [  41% ] 04/10 VUs  1m51.0s/4m30.0s

running (1m51.5s), 04/10 VUs, 183750 complete and 0 interrupted iterations
ramp   [  41% ] 04/10 VUs  1m52.0s/4m30.0s

running (1m52.5s), 04/10 VUs, 185993 complete and 0 interrupted iterations
ramp   [  42% ] 04/10 VUs  1m53.0s/4m30.0s

running (1m53.5s), 04/10 VUs, 188202 complete and 0 interrupted iterations
ramp   [  42% ] 04/10 VUs  1m54.0s/4m30.0s

running (1m54.5s), 04/10 VUs, 190417 complete and 0 interrupted iterations
ramp   [  43% ] 04/10 VUs  1m55.0s/4m30.0s

running (1m55.5s), 04/10 VUs, 192655 complete and 0 interrupted iterations
ramp   [  43% ] 04/10 VUs  1m56.0s/4m30.0s

running (1m56.5s), 04/10 VUs, 194788 complete and 0 interrupted iterations
ramp   [  43% ] 04/10 VUs  1m57.0s/4m30.0s

running (1m57.5s), 04/10 VUs, 196835 complete and 0 interrupted iterations
ramp   [  44% ] 04/10 VUs  1m58.0s/4m30.0s

running (1m58.5s), 04/10 VUs, 199004 complete and 0 interrupted iterations
ramp   [  44% ] 04/10 VUs  1m59.0s/4m30.0s

running (1m59.5s), 04/10 VUs, 201198 complete and 0 interrupted iterations
ramp   [  44% ] 04/10 VUs  2m00.0s/4m30.0s

running (2m00.5s), 05/10 VUs, 203390 complete and 0 interrupted iterations
ramp   [  45% ] 05/10 VUs  2m01.0s/4m30.0s

running (2m01.5s), 05/10 VUs, 205639 complete and 0 interrupted iterations
ramp   [  45% ] 05/10 VUs  2m02.0s/4m30.0s

running (2m02.5s), 05/10 VUs, 207856 complete and 0 interrupted iterations
ramp   [  46% ] 05/10 VUs  2m03.0s/4m30.0s

running (2m03.5s), 05/10 VUs, 209977 complete and 0 interrupted iterations
ramp   [  46% ] 05/10 VUs  2m04.0s/4m30.0s

running (2m04.5s), 05/10 VUs, 212134 complete and 0 interrupted iterations
ramp   [  46% ] 05/10 VUs  2m05.0s/4m30.0s

running (2m05.5s), 05/10 VUs, 214293 complete and 0 interrupted iterations
ramp   [  47% ] 05/10 VUs  2m06.0s/4m30.0s

running (2m06.5s), 05/10 VUs, 216455 complete and 0 interrupted iterations
ramp   [  47% ] 05/10 VUs  2m07.0s/4m30.0s

running (2m07.5s), 05/10 VUs, 218634 complete and 0 interrupted iterations
ramp   [  47% ] 05/10 VUs  2m08.0s/4m30.0s

running (2m08.5s), 05/10 VUs, 220795 complete and 0 interrupted iterations
ramp   [  48% ] 05/10 VUs  2m09.0s/4m30.0s

running (2m09.5s), 05/10 VUs, 222999 complete and 0 interrupted iterations
ramp   [  48% ] 05/10 VUs  2m10.0s/4m30.0s

running (2m10.5s), 05/10 VUs, 225170 complete and 0 interrupted iterations
ramp   [  49% ] 05/10 VUs  2m11.0s/4m30.0s

running (2m11.5s), 05/10 VUs, 227382 complete and 0 interrupted iterations
ramp   [  49% ] 05/10 VUs  2m12.0s/4m30.0s

running (2m12.5s), 05/10 VUs, 229618 complete and 0 interrupted iterations
ramp   [  49% ] 05/10 VUs  2m13.0s/4m30.0s

running (2m13.5s), 05/10 VUs, 231826 complete and 0 interrupted iterations
ramp   [  50% ] 05/10 VUs  2m14.0s/4m30.0s

running (2m14.5s), 05/10 VUs, 234038 complete and 0 interrupted iterations
ramp   [  50% ] 05/10 VUs  2m15.0s/4m30.0s

running (2m15.4s), 05/10 VUs, 236246 complete and 0 interrupted iterations
ramp   [  50% ] 05/10 VUs  2m16.0s/4m30.0s

running (2m16.4s), 05/10 VUs, 238501 complete and 0 interrupted iterations
ramp   [  51% ] 05/10 VUs  2m17.0s/4m30.0s

running (2m17.4s), 05/10 VUs, 240768 complete and 0 interrupted iterations
ramp   [  51% ] 05/10 VUs  2m18.0s/4m30.0s

running (2m18.4s), 05/10 VUs, 242862 complete and 0 interrupted iterations
ramp   [  51% ] 05/10 VUs  2m19.0s/4m30.0s

running (2m19.4s), 05/10 VUs, 245118 complete and 0 interrupted iterations
ramp   [  52% ] 05/10 VUs  2m20.0s/4m30.0s

running (2m20.4s), 05/10 VUs, 247330 complete and 0 interrupted iterations
ramp   [  52% ] 05/10 VUs  2m21.0s/4m30.0s

running (2m21.4s), 05/10 VUs, 249590 complete and 0 interrupted iterations
ramp   [  53% ] 05/10 VUs  2m22.0s/4m30.0s

running (2m22.4s), 05/10 VUs, 251837 complete and 0 interrupted iterations
ramp   [  53% ] 05/10 VUs  2m23.0s/4m30.0s

running (2m23.4s), 05/10 VUs, 254050 complete and 0 interrupted iterations
ramp   [  53% ] 05/10 VUs  2m24.0s/4m30.0s

running (2m24.4s), 05/10 VUs, 256099 complete and 0 interrupted iterations
ramp   [  54% ] 05/10 VUs  2m25.0s/4m30.0s

running (2m25.4s), 05/10 VUs, 258333 complete and 0 interrupted iterations
ramp   [  54% ] 05/10 VUs  2m26.0s/4m30.0s

running (2m26.4s), 05/10 VUs, 260552 complete and 0 interrupted iterations
ramp   [  54% ] 05/10 VUs  2m27.0s/4m30.0s

running (2m27.4s), 05/10 VUs, 262764 complete and 0 interrupted iterations
ramp   [  55% ] 05/10 VUs  2m28.0s/4m30.0s

running (2m28.4s), 05/10 VUs, 264877 complete and 0 interrupted iterations
ramp   [  55% ] 05/10 VUs  2m29.0s/4m30.0s

running (2m29.4s), 05/10 VUs, 267113 complete and 0 interrupted iterations
ramp   [  56% ] 05/10 VUs  2m30.0s/4m30.0s

running (2m30.4s), 05/10 VUs, 269270 complete and 0 interrupted iterations
ramp   [  56% ] 05/10 VUs  2m31.0s/4m30.0s

running (2m31.4s), 05/10 VUs, 271506 complete and 0 interrupted iterations
ramp   [  56% ] 05/10 VUs  2m32.0s/4m30.0s

running (2m32.4s), 05/10 VUs, 273717 complete and 0 interrupted iterations
ramp   [  57% ] 05/10 VUs  2m33.0s/4m30.0s

running (2m33.4s), 05/10 VUs, 275949 complete and 0 interrupted iterations
ramp   [  57% ] 05/10 VUs  2m34.0s/4m30.0s

running (2m34.4s), 05/10 VUs, 278109 complete and 0 interrupted iterations
ramp   [  57% ] 05/10 VUs  2m35.0s/4m30.0s

running (2m35.4s), 05/10 VUs, 280352 complete and 0 interrupted iterations
ramp   [  58% ] 05/10 VUs  2m36.0s/4m30.0s

running (2m36.4s), 06/10 VUs, 282616 complete and 0 interrupted iterations
ramp   [  58% ] 06/10 VUs  2m37.0s/4m30.0s

running (2m37.4s), 06/10 VUs, 284878 complete and 0 interrupted iterations
ramp   [  59% ] 06/10 VUs  2m38.0s/4m30.0s

running (2m38.4s), 06/10 VUs, 287032 complete and 0 interrupted iterations
ramp   [  59% ] 06/10 VUs  2m39.0s/4m30.0s

running (2m39.4s), 06/10 VUs, 289274 complete and 0 interrupted iterations
ramp   [  59% ] 06/10 VUs  2m40.0s/4m30.0s

running (2m40.4s), 06/10 VUs, 291514 complete and 0 interrupted iterations
ramp   [  60% ] 06/10 VUs  2m41.0s/4m30.0s

running (2m41.4s), 06/10 VUs, 293776 complete and 0 interrupted iterations
ramp   [  60% ] 06/10 VUs  2m42.0s/4m30.0s

running (2m42.4s), 06/10 VUs, 296054 complete and 0 interrupted iterations
ramp   [  60% ] 06/10 VUs  2m43.0s/4m30.0s

running (2m43.4s), 07/10 VUs, 298359 complete and 0 interrupted iterations
ramp   [  61% ] 07/10 VUs  2m44.0s/4m30.0s

running (2m44.4s), 07/10 VUs, 300742 complete and 0 interrupted iterations
ramp   [  61% ] 07/10 VUs  2m45.0s/4m30.0s

running (2m45.2s), 07/10 VUs, 303079 complete and 0 interrupted iterations
ramp   [  61% ] 07/10 VUs  2m46.0s/4m30.0s

running (2m46.2s), 07/10 VUs, 305454 complete and 0 interrupted iterations
ramp   [  62% ] 07/10 VUs  2m47.0s/4m30.0s

running (2m47.2s), 07/10 VUs, 307871 complete and 0 interrupted iterations
ramp   [  62% ] 07/10 VUs  2m48.0s/4m30.0s

running (2m48.2s), 07/10 VUs, 310185 complete and 0 interrupted iterations
ramp   [  63% ] 07/10 VUs  2m49.0s/4m30.0s

running (2m49.2s), 07/10 VUs, 312584 complete and 0 interrupted iterations
ramp   [  63% ] 07/10 VUs  2m50.0s/4m30.0s

running (2m50.2s), 08/10 VUs, 314950 complete and 0 interrupted iterations
ramp   [  63% ] 08/10 VUs  2m51.0s/4m30.0s

running (2m51.2s), 08/10 VUs, 317356 complete and 0 interrupted iterations
ramp   [  64% ] 08/10 VUs  2m52.0s/4m30.0s

running (2m52.2s), 08/10 VUs, 319714 complete and 0 interrupted iterations
ramp   [  64% ] 08/10 VUs  2m53.0s/4m30.0s

running (2m53.2s), 08/10 VUs, 322102 complete and 0 interrupted iterations
ramp   [  64% ] 08/10 VUs  2m54.0s/4m30.0s

running (2m54.2s), 08/10 VUs, 324448 complete and 0 interrupted iterations
ramp   [  65% ] 08/10 VUs  2m55.0s/4m30.0s

running (2m55.2s), 08/10 VUs, 326775 complete and 0 interrupted iterations
ramp   [  65% ] 08/10 VUs  2m56.0s/4m30.0s

running (2m56.2s), 08/10 VUs, 329121 complete and 0 interrupted iterations
ramp   [  66% ] 08/10 VUs  2m57.0s/4m30.0s

running (2m57.2s), 08/10 VUs, 331502 complete and 0 interrupted iterations
ramp   [  66% ] 08/10 VUs  2m58.0s/4m30.0s

running (2m58.2s), 08/10 VUs, 333713 complete and 0 interrupted iterations
ramp   [  66% ] 08/10 VUs  2m59.0s/4m30.0s

running (2m59.2s), 08/10 VUs, 336109 complete and 0 interrupted iterations
ramp   [  67% ] 08/10 VUs  3m00.0s/4m30.0s

running (3m00.2s), 08/10 VUs, 338393 complete and 0 interrupted iterations
ramp   [  67% ] 08/10 VUs  3m01.0s/4m30.0s

running (3m01.2s), 08/10 VUs, 340771 complete and 0 interrupted iterations
ramp   [  67% ] 08/10 VUs  3m02.0s/4m30.0s

running (3m02.2s), 08/10 VUs, 343108 complete and 0 interrupted iterations
ramp   [  68% ] 08/10 VUs  3m03.0s/4m30.0s

running (3m03.2s), 08/10 VUs, 345484 complete and 0 interrupted iterations
ramp   [  68% ] 08/10 VUs  3m04.0s/4m30.0s

running (3m04.2s), 08/10 VUs, 347818 complete and 0 interrupted iterations
ramp   [  69% ] 08/10 VUs  3m05.0s/4m30.0s

running (3m05.2s), 08/10 VUs, 350135 complete and 0 interrupted iterations
ramp   [  69% ] 08/10 VUs  3m06.0s/4m30.0s

running (3m06.2s), 08/10 VUs, 352490 complete and 0 interrupted iterations
ramp   [  69% ] 08/10 VUs  3m07.0s/4m30.0s

running (3m07.2s), 08/10 VUs, 354753 complete and 0 interrupted iterations
ramp   [  70% ] 08/10 VUs  3m08.0s/4m30.0s

running (3m08.2s), 08/10 VUs, 356963 complete and 0 interrupted iterations
ramp   [  70% ] 08/10 VUs  3m09.0s/4m30.0s

running (3m09.2s), 08/10 VUs, 359244 complete and 0 interrupted iterations
ramp   [  70% ] 08/10 VUs  3m10.0s/4m30.0s

running (3m10.2s), 08/10 VUs, 361530 complete and 0 interrupted iterations
ramp   [  71% ] 08/10 VUs  3m11.0s/4m30.0s

running (3m11.2s), 08/10 VUs, 363849 complete and 0 interrupted iterations
ramp   [  71% ] 08/10 VUs  3m12.0s/4m30.0s

running (3m12.2s), 08/10 VUs, 366206 complete and 0 interrupted iterations
ramp   [  71% ] 08/10 VUs  3m13.0s/4m30.0s

running (3m13.2s), 08/10 VUs, 368506 complete and 0 interrupted iterations
ramp   [  72% ] 08/10 VUs  3m14.0s/4m30.0s

running (3m14.2s), 08/10 VUs, 370848 complete and 0 interrupted iterations
ramp   [  72% ] 08/10 VUs  3m15.0s/4m30.0s

running (3m15.1s), 08/10 VUs, 373153 complete and 0 interrupted iterations
ramp   [  73% ] 08/10 VUs  3m16.0s/4m30.0s

running (3m16.1s), 08/10 VUs, 375566 complete and 0 interrupted iterations
ramp   [  73% ] 08/10 VUs  3m17.0s/4m30.0s

running (3m17.1s), 08/10 VUs, 377960 complete and 0 interrupted iterations
ramp   [  73% ] 08/10 VUs  3m18.0s/4m30.0s

running (3m18.1s), 08/10 VUs, 380203 complete and 0 interrupted iterations
ramp   [  74% ] 08/10 VUs  3m19.0s/4m30.0s

running (3m19.1s), 08/10 VUs, 382591 complete and 0 interrupted iterations
ramp   [  74% ] 08/10 VUs  3m20.0s/4m30.0s

running (3m20.1s), 08/10 VUs, 384898 complete and 0 interrupted iterations
ramp   [  74% ] 08/10 VUs  3m21.0s/4m30.0s

running (3m21.1s), 08/10 VUs, 387266 complete and 0 interrupted iterations
ramp   [  75% ] 08/10 VUs  3m22.0s/4m30.0s

running (3m22.1s), 08/10 VUs, 389608 complete and 0 interrupted iterations
ramp   [  75% ] 08/10 VUs  3m23.0s/4m30.0s

running (3m23.1s), 08/10 VUs, 391915 complete and 0 interrupted iterations
ramp   [  76% ] 08/10 VUs  3m24.0s/4m30.0s

running (3m24.1s), 08/10 VUs, 394237 complete and 0 interrupted iterations
ramp   [  76% ] 08/10 VUs  3m25.0s/4m30.0s

running (3m25.1s), 08/10 VUs, 396487 complete and 0 interrupted iterations
ramp   [  76% ] 08/10 VUs  3m26.0s/4m30.0s

running (3m26.1s), 08/10 VUs, 398795 complete and 0 interrupted iterations
ramp   [  77% ] 08/10 VUs  3m27.0s/4m30.0s

running (3m27.1s), 08/10 VUs, 401139 complete and 0 interrupted iterations
ramp   [  77% ] 08/10 VUs  3m28.0s/4m30.0s

running (3m28.1s), 08/10 VUs, 403308 complete and 0 interrupted iterations
ramp   [  77% ] 08/10 VUs  3m29.0s/4m30.0s

running (3m29.1s), 08/10 VUs, 405645 complete and 0 interrupted iterations
ramp   [  78% ] 08/10 VUs  3m30.0s/4m30.0s

running (3m30.1s), 09/10 VUs, 407894 complete and 0 interrupted iterations
ramp   [  78% ] 09/10 VUs  3m31.0s/4m30.0s

running (3m31.1s), 09/10 VUs, 410233 complete and 0 interrupted iterations
ramp   [  79% ] 09/10 VUs  3m32.0s/4m30.0s

running (3m32.1s), 09/10 VUs, 412593 complete and 0 interrupted iterations
ramp   [  79% ] 09/10 VUs  3m33.0s/4m30.0s

running (3m33.1s), 09/10 VUs, 414903 complete and 0 interrupted iterations
ramp   [  79% ] 09/10 VUs  3m34.0s/4m30.0s

running (3m34.1s), 09/10 VUs, 417243 complete and 0 interrupted iterations
ramp   [  80% ] 09/10 VUs  3m35.0s/4m30.0s

running (3m35.1s), 09/10 VUs, 419516 complete and 0 interrupted iterations
ramp   [  80% ] 09/10 VUs  3m36.0s/4m30.0s

running (3m36.1s), 09/10 VUs, 421844 complete and 0 interrupted iterations
ramp   [  80% ] 09/10 VUs  3m37.0s/4m30.0s

running (3m37.1s), 09/10 VUs, 424138 complete and 0 interrupted iterations
ramp   [  81% ] 09/10 VUs  3m38.0s/4m30.0s

running (3m38.1s), 09/10 VUs, 426331 complete and 0 interrupted iterations
ramp   [  81% ] 09/10 VUs  3m39.0s/4m30.0s

running (3m39.1s), 09/10 VUs, 428631 complete and 0 interrupted iterations
ramp   [  81% ] 09/10 VUs  3m40.0s/4m30.0s

running (3m40.1s), 10/10 VUs, 430904 complete and 0 interrupted iterations
ramp   [  82% ] 10/10 VUs  3m41.0s/4m30.0s

running (3m41.1s), 10/10 VUs, 433182 complete and 0 interrupted iterations
ramp   [  82% ] 10/10 VUs  3m42.0s/4m30.0s

running (3m42.1s), 10/10 VUs, 435510 complete and 0 interrupted iterations
ramp   [  83% ] 10/10 VUs  3m43.0s/4m30.0s

running (3m43.1s), 10/10 VUs, 437799 complete and 0 interrupted iterations
ramp   [  83% ] 10/10 VUs  3m44.0s/4m30.0s

running (3m44.1s), 10/10 VUs, 440122 complete and 0 interrupted iterations
ramp   [  83% ] 10/10 VUs  3m45.0s/4m30.0s

running (3m45.0s), 10/10 VUs, 442449 complete and 0 interrupted iterations
ramp   [  84% ] 10/10 VUs  3m46.0s/4m30.0s

running (3m46.0s), 10/10 VUs, 444766 complete and 0 interrupted iterations
ramp   [  84% ] 10/10 VUs  3m47.0s/4m30.0s

running (3m47.0s), 10/10 VUs, 447100 complete and 0 interrupted iterations
ramp   [  84% ] 10/10 VUs  3m48.0s/4m30.0s

running (3m48.0s), 10/10 VUs, 449330 complete and 0 interrupted iterations
ramp   [  85% ] 10/10 VUs  3m49.0s/4m30.0s

running (3m49.0s), 10/10 VUs, 451694 complete and 0 interrupted iterations
ramp   [  85% ] 10/10 VUs  3m50.0s/4m30.0s

running (3m50.0s), 10/10 VUs, 453881 complete and 0 interrupted iterations
ramp   [  86% ] 10/10 VUs  3m51.0s/4m30.0s

running (3m51.0s), 10/10 VUs, 456234 complete and 0 interrupted iterations
ramp   [  86% ] 10/10 VUs  3m52.0s/4m30.0s

running (3m52.0s), 10/10 VUs, 458552 complete and 0 interrupted iterations
ramp   [  86% ] 10/10 VUs  3m53.0s/4m30.0s

running (3m53.0s), 10/10 VUs, 460906 complete and 0 interrupted iterations
ramp   [  87% ] 10/10 VUs  3m54.0s/4m30.0s

running (3m54.0s), 10/10 VUs, 463218 complete and 0 interrupted iterations
ramp   [  87% ] 10/10 VUs  3m55.0s/4m30.0s

running (3m55.0s), 10/10 VUs, 465559 complete and 0 interrupted iterations
ramp   [  87% ] 10/10 VUs  3m56.0s/4m30.0s

running (3m56.0s), 10/10 VUs, 467871 complete and 0 interrupted iterations
ramp   [  88% ] 10/10 VUs  3m57.0s/4m30.0s

running (3m57.0s), 10/10 VUs, 470204 complete and 0 interrupted iterations
ramp   [  88% ] 10/10 VUs  3m58.0s/4m30.0s

running (3m58.0s), 10/10 VUs, 472381 complete and 0 interrupted iterations
ramp   [  89% ] 10/10 VUs  3m59.0s/4m30.0s

running (3m59.0s), 10/10 VUs, 474676 complete and 0 interrupted iterations
ramp   [  89% ] 10/10 VUs  4m00.0s/4m30.0s

running (4m00.0s), 10/10 VUs, 476962 complete and 0 interrupted iterations
ramp   [  89% ] 10/10 VUs  4m01.0s/4m30.0s

running (4m01.0s), 10/10 VUs, 479254 complete and 0 interrupted iterations
ramp   [  90% ] 10/10 VUs  4m02.0s/4m30.0s

running (4m02.0s), 10/10 VUs, 481567 complete and 0 interrupted iterations
ramp   [  90% ] 10/10 VUs  4m03.0s/4m30.0s

running (4m03.0s), 10/10 VUs, 483849 complete and 0 interrupted iterations
ramp   [  90% ] 10/10 VUs  4m04.0s/4m30.0s

running (4m04.0s), 10/10 VUs, 486148 complete and 0 interrupted iterations
ramp   [  91% ] 10/10 VUs  4m05.0s/4m30.0s

running (4m05.0s), 10/10 VUs, 488421 complete and 0 interrupted iterations
ramp   [  91% ] 10/10 VUs  4m06.0s/4m30.0s

running (4m06.0s), 10/10 VUs, 490719 complete and 0 interrupted iterations
ramp   [  91% ] 10/10 VUs  4m07.0s/4m30.0s

running (4m07.0s), 10/10 VUs, 492975 complete and 0 interrupted iterations
ramp   [  92% ] 10/10 VUs  4m08.0s/4m30.0s

running (4m08.0s), 10/10 VUs, 495162 complete and 0 interrupted iterations
ramp   [  92% ] 10/10 VUs  4m09.0s/4m30.0s

running (4m09.0s), 10/10 VUs, 497461 complete and 0 interrupted iterations
ramp   [  93% ] 10/10 VUs  4m10.0s/4m30.0s

running (4m10.0s), 10/10 VUs, 499675 complete and 0 interrupted iterations
ramp   [  93% ] 10/10 VUs  4m11.0s/4m30.0s

running (4m11.0s), 10/10 VUs, 501965 complete and 0 interrupted iterations
ramp   [  93% ] 10/10 VUs  4m12.0s/4m30.0s

running (4m12.0s), 09/10 VUs, 504251 complete and 0 interrupted iterations
ramp   [  94% ] 09/10 VUs  4m13.0s/4m30.0s

running (4m13.0s), 09/10 VUs, 506571 complete and 0 interrupted iterations
ramp   [  94% ] 09/10 VUs  4m14.0s/4m30.0s

running (4m14.0s), 08/10 VUs, 508842 complete and 0 interrupted iterations
ramp   [  94% ] 08/10 VUs  4m15.0s/4m30.0s

running (4m14.8s), 08/10 VUs, 511119 complete and 0 interrupted iterations
ramp   [  95% ] 08/10 VUs  4m16.0s/4m30.0s

running (4m15.8s), 07/10 VUs, 513434 complete and 0 interrupted iterations
ramp   [  95% ] 07/10 VUs  4m17.0s/4m30.0s

running (4m16.8s), 07/10 VUs, 515803 complete and 0 interrupted iterations
ramp   [  96% ] 07/10 VUs  4m18.0s/4m30.0s

running (4m17.8s), 06/10 VUs, 517926 complete and 0 interrupted iterations
ramp   [  96% ] 06/10 VUs  4m19.0s/4m30.0s

running (4m18.8s), 06/10 VUs, 520211 complete and 0 interrupted iterations
ramp   [  96% ] 06/10 VUs  4m20.0s/4m30.0s

running (4m19.8s), 05/10 VUs, 522290 complete and 0 interrupted iterations
ramp   [  97% ] 05/10 VUs  4m21.0s/4m30.0s

running (4m20.8s), 05/10 VUs, 524434 complete and 0 interrupted iterations
ramp   [  97% ] 05/10 VUs  4m22.0s/4m30.0s

running (4m21.8s), 04/10 VUs, 526489 complete and 0 interrupted iterations
ramp   [  97% ] 04/10 VUs  4m23.0s/4m30.0s

running (4m22.8s), 04/10 VUs, 528539 complete and 0 interrupted iterations
ramp   [  98% ] 04/10 VUs  4m24.0s/4m30.0s

running (4m23.8s), 03/10 VUs, 530485 complete and 0 interrupted iterations
ramp   [  98% ] 03/10 VUs  4m25.0s/4m30.0s

running (4m24.8s), 03/10 VUs, 532377 complete and 0 interrupted iterations
ramp   [  99% ] 03/10 VUs  4m26.0s/4m30.0s

running (4m25.8s), 02/10 VUs, 534030 complete and 0 interrupted iterations
ramp   [  99% ] 02/10 VUs  4m27.0s/4m30.0s

running (4m26.8s), 02/10 VUs, 535668 complete and 0 interrupted iterations
ramp   [  99% ] 02/10 VUs  4m28.0s/4m30.0s

running (4m27.8s), 01/10 VUs, 536648 complete and 0 interrupted iterations
ramp   [ 100% ] 01/10 VUs  4m29.0s/4m30.0s

running (4m28.8s), 01/10 VUs, 537673 complete and 0 interrupted iterations
ramp   [ 100% ] 01/10 VUs  4m30.0s/4m30.0s

     ✓ status 200
     ✓ body not empty

     checks.........................: 100.00% 1075358 out of 1075358
     data_received..................: 4.2 GB  16 MB/s
     data_sent......................: 53 MB   196 kB/s
     http_req_blocked...............: avg=144.35µs min=0s           med=146.03µs max=2.83ms  p(90)=198.35µs p(95)=217.47µs
     http_req_connecting............: avg=111.52µs min=-132378582ns med=112.42µs max=2.79ms  p(90)=156.65µs p(95)=173.41µs
   ✓ http_req_duration..............: avg=2.33ms   min=-131100260ns med=2.12ms   max=27.73ms p(90)=3.99ms   p(95)=4.25ms  
       { expected_response:true }...: avg=2.33ms   min=-131100260ns med=2.12ms   max=27.73ms p(90)=3.99ms   p(95)=4.25ms  
   ✓ http_req_failed................: 0.00%   0 out of 537679
     http_req_receiving.............: avg=89.38µs  min=-132391977ns med=80.9µs   max=3.89ms  p(90)=138.73µs p(95)=163.77µs
     http_req_sending...............: avg=30.17µs  min=3.55µs       med=21.87µs  max=2.47ms  p(90)=60.95µs  p(95)=71.07µs 
     http_req_tls_handshaking.......: avg=0s       min=0s           med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=2.21ms   min=0s           med=2ms      max=27.6ms  p(90)=3.88ms   p(95)=4.13ms  
     http_reqs......................: 537679  1999.96092/s
     iteration_duration.............: avg=2.54ms   min=730.71µs     med=2.32ms   max=28.03ms p(90)=4.2ms    p(95)=4.45ms  
     iterations.....................: 537679  1999.96092/s
     vus............................: 1       min=1                  max=10
     vus_max........................: 10      min=10                 max=10


running (4m28.8s), 00/10 VUs, 537679 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 00/10 VUs  4m30s